In [1]:
# Import dependencies
import pandas as pd
import numpy as np

pd.set_option('max_colwidth', 200)
pd.set_option("display.expand_frame_repr", False)

In [2]:
# import additional dependencies
import json
from datetime import datetime as dt

### Extract the crowdfunding.xlsx Data

In [3]:
# save file path to crowdfunding input
funding = 'Resources/crowdfunding.xlsx'

In [4]:
# read file into Pandas DF
crowdfunding_info_df = pd.read_excel(funding)
crowdfunding_info_df.head()

   cf_id  contact_id                 company_name                                          blurb    goal  pledged     outcome  backers_count country currency  launched_at    deadline  staff_pick  spotlight category & sub-category
0    147        4661   Baldwin, Riley and Jackson           Pre-emptive tertiary standardization     100        0      failed              0      CA      CAD   1581573600  1614578400       False      False        food/food trucks
1   1621        3765                     Odom Inc               Managed bottom-line architecture    1400    14560  successful            158      US      USD   1611554400  1621918800       False       True              music/rock
2   1812        4187   Melton, Robinson and Fritz   Function-based leadingedge pricing structure  108400   142523  successful           1425      AU      AUD   1608184800  1640844000       False      False          technology/web
3   2156        4941  Mcdonald, Gonzalez and Ross  Vision-oriented fresh-thinking conglomeration    4200     2477      failed             24      US      USD   1634792400  1642399200       False      False              music/rock
4   1365        2199                Larson-Little                      Proactive foreground core    7600     5265      failed             53      US      USD   1608530400  1629694800       False      False           theater/plays

In [5]:
# Get a brief summary of the crowdfunding_info DataFrame.
crowdfunding_info_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   cf_id                    1000 non-null   int64
 1   contact_id               1000 non-null   int64
 2   company_name             1000 non-null   object
 3   blurb                    1000 non-null   object
 4   goal                     1000 non-null   int64
 5   pledged                  1000 non-null   int64
 6   outcome                  1000 non-null   object
 7   backers_count            1000 non-null   int64
 8   country                  1000 non-null   object
 9   currency                 1000 non-null   object
 10  launched_at              1000 non-null   int64
 11  deadline                 1000 non-null   int64
 12  staff_pick               1000 non-null   bool
 13  spotlight                1000 non-null   bool
 14  category & sub-category  1000 non-null   object
dtypes: bool(2), int64(7), object(6)
memory usage: 103.6+ KB

### Create the Category and Subcategory DataFrames
---
**Create a Category DataFrame that has the following columns:**
- A "category_id" column that is numbered sequential form 1 to the length of the number of unique categories.
- A "category" column that has only the categories.

Export the DataFrame as a `category.csv` CSV file.

**Create a SubCategory DataFrame that has the following columns:**
- A "subcategory_id" column that is numbered sequential form 1 to the length of the number of unique subcategories.
- A "subcategory" column that has only the subcategories. 

Export the DataFrame as a `subcategory.csv` CSV file.

In [6]:
# Get the crowdfunding_info_df columns.
crowdfunding_info_df.keys()

Index(['cf_id', 'contact_id', 'company_name', 'blurb', 'goal', 'pledged',
       'outcome', 'backers_count', 'country', 'currency', 'launched_at',
       'deadline', 'staff_pick', 'spotlight', 'category & sub-category'],
      dtype='object')

In [8]:
# Assign the category and subcategory values to category and subcategory columns.
crowdfunding_info_df[['category', 'subcategory']] = crowdfunding_info_df['category & sub-category'].str.split('/', n=1, expand = True)
crowdfunding_info_df.head()

   cf_id  contact_id                 company_name                                          blurb    goal  pledged     outcome  backers_count country currency  launched_at    deadline  staff_pick  spotlight category & sub-category    category  subcategory
0    147        4661   Baldwin, Riley and Jackson           Pre-emptive tertiary standardization     100        0      failed              0      CA      CAD   1581573600  1614578400       False      False        food/food trucks        food  food trucks
1   1621        3765                     Odom Inc               Managed bottom-line architecture    1400    14560  successful            158      US      USD   1611554400  1621918800       False       True              music/rock       music         rock
2   1812        4187   Melton, Robinson and Fritz   Function-based leadingedge pricing structure  108400   142523  successful           1425      AU      AUD   1608184800  1640844000       False      False          technology/web  technology          web
3   2156        4941  Mcdonald, Gonzalez and Ross  Vision-oriented fresh-thinking conglomeration    4200     2477      failed             24      US      USD   1634792400  1642399200       False      False              music/rock       music         rock
4   1365        2199                Larson-Little                      Proactive foreground core    7600     5265      failed             53      US      USD   1608530400  1629694800       False      False           theater/plays     theater        plays

In [10]:
# Get the unique categories and subcategories in separate lists.
categories = crowdfunding_info_df["category"].unique()
subcategories = crowdfunding_info_df["subcategory"].unique()

print(categories)
print()
print(subcategories)

['food' 'music' 'technology' 'theater' 'film & video' 'publishing' 'games'
 'photography' 'journalism']

['food trucks' 'rock' 'web' 'plays' 'documentary' 'electric music' 'drama'
 'indie rock' 'wearables' 'nonfiction' 'animation' 'video games' 'shorts'
 'fiction' 'photography books' 'radio & podcasts' 'metal' 'jazz'
 'translations' 'television' 'mobile games' 'world music'
 'science fiction' 'audio']

In [11]:
# Get the number of distinct values in the categories and subcategories lists.

print(len(categories))
print()
print(len(subcategories))

9

24

In [12]:
# Create numpy arrays from 1-9 for the categories and 1-24 for the subcategories.
category_ids = np.arange(1, 10)
subcategory_ids = np.arange(1, 25)

print(category_ids)
print()
print(subcategory_ids)

[1 2 3 4 5 6 7 8 9]

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24]

In [13]:
# Use a list comprehension to add "cat" to each category_id. 
cat_ids = ["cat" + str(c) for c in category_ids]

# Use a list comprehension to add "subcat" to each subcategory_id.    
scat_ids = ["scat" + str(s) for s in subcategory_ids]

print(cat_ids)
print()
print(scat_ids)

['cat1', 'cat2', 'cat3', 'cat4', 'cat5', 'cat6', 'cat7', 'cat8', 'cat9']

['scat1', 'scat2', 'scat3', 'scat4', 'scat5', 'scat6', 'scat7', 'scat8', 'scat9', 'scat10', 'scat11', 'scat12', 'scat13', 'scat14', 'scat15', 'scat16', 'scat17', 'scat18', 'scat19', 'scat20', 'scat21', 'scat22', 'scat23', 'scat24']

In [14]:
# Create a category DataFrame with the category_id array as the category_id and categories list as the category name.
category_df = pd.DataFrame({
    "category_id": cat_ids,
    "category": categories})

# Create a category DataFrame with the subcategory_id array as the subcategory_id and subcategories list as the subcategory name.
subcategory_df = pd.DataFrame({
    "subcategory_id": scat_ids,
    "subcategory": subcategories})

In [15]:
# preview category DataFrame
category_df.head()

  category_id      category
0        cat1          food
1        cat2         music
2        cat3    technology
3        cat4       theater
4        cat5  film & video

In [16]:
# preview_subcategory DataFrame
subcategory_df.head()

  subcategory_id  subcategory
0          scat1  food trucks
1          scat2         rock
2          scat3          web
3          scat4        plays
4          scat5  documentary

In [17]:
# Export categories_df and subcategories_df as CSV files.
category_df.to_csv("Resources/category.csv", index=False)

subcategory_df.to_csv("Resources/subcategory.csv", index=False)

### Campaign DataFrame
----
**Create a Campaign DataFrame that has the following columns:**
- The "cf_id" column.
- The "contact_id" column.
- The “company_name” column.
- The "blurb" column is renamed as "description."
- The "goal" column.
- The "goal" column is converted to a `float` datatype.
- The "pledged" column is converted to a `float` datatype. 
- The "backers_count" column. 
- The "country" column.
- The "currency" column.
- The "launched_at" column is renamed as "launch_date" and converted to a datetime format. 
- The "deadline" column is renamed as "end_date" and converted to a datetime format.
- The "category_id" with the unique number matching the “category_id” from the category DataFrame. 
- The "subcategory_id" with the unique number matching the “subcategory_id” from the subcategory DataFrame.
- And, create a column that contains the unique four-digit contact ID number from the `contact.xlsx` file.
 

Then export the DataFrame as a `campaign.csv` CSV file.

In [ ]:
# Create a copy of the crowdfunding_info_df DataFrame name campaign_df. 
campaign_df = crowdfunding_info_df.copy()
campaign_df.head()

In [ ]:
# Rename the blurb, launched_at, and deadline columns.

In [ ]:
# Convert the goal and pledged columns to a `float` data type.

In [ ]:
# Check the datatypes

In [ ]:
# Format the launched_date and end_date columns to datetime format

In [ ]:
# Merge the campaign_df with the category_df on the "category" column and 
# the subcategory_df on the "subcategory" column.

campaign_merged_df.tail(10)

In [ ]:
# Drop unwanted columns

In [ ]:
# Export the DataFrame as a CSV file. 
campaign_cleaned.to_csv("Resources/campaign.csv", index=False)

### Extract the contacts.xlsx Data.

In [18]:
# save file path to contacts input
contacts = 'Resources/contacts.xlsx'

In [19]:
# read into Pandas DF, Use the `header=3` parameter
contact_info_df = pd.read_excel(contacts, header = 3)
contact_info_df.head()

                                                                                contact_info
0   {"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}
1          {"contact_id": 3765, "name": "Mariana Ellis", "email": "mariana.ellis@rossi.org"}
2            {"contact_id": 4187, "name": "Sofie Woods", "email": "sofie.woods@riviere.com"}
3  {"contact_id": 4941, "name": "Jeanette Iannotti", "email": "jeanette.iannotti@yahoo.com"}
4        {"contact_id": 2199, "name": "Samuel Sorgatz", "email": "samuel.sorgatz@gmail.com"}

### Create the Contacts DataFrame 
---
**Create a Contacts DataFrame that has the following columns:**
- A column named "contact_id"  that contains the unique number of the contact person.
- A column named "first_name" that contains the first name of the contact person.
- A column named "last_name" that contains the first name of the contact person.
- A column named "email" that contains the email address of the contact person

Then export the DataFrame as a `contacts.csv` CSV file.

### Option 1: Use Pandas to create the contacts DataFrame.

In [20]:
# create blank list - use for list of dictionaries
dict_values = []

In [21]:
# convert DataFrame to a dictionary -- using list comprehension
for i, row in contact_info_df.iterrows():
    data = row['contact_info']
    contact_list = json.loads(data)
    details = [value for key, value in contact_list.items()]
    dict_values.append(details)

# Print out the list of values for each row.
print(dict_values[0:5])

[[4661, 'Cecilia Velasco', 'cecilia.velasco@rodrigues.fr'], [3765, 'Mariana Ellis', 'mariana.ellis@rossi.org'], [4187, 'Sofie Woods', 'sofie.woods@riviere.com'], [4941, 'Jeanette Iannotti', 'jeanette.iannotti@yahoo.com'], [2199, 'Samuel Sorgatz', 'samuel.sorgatz@gmail.com']]

In [22]:
# opt_2: convert DataFrame to dictionary using nested for_loop

# create new empty list to store dictionaries
opt_2_dict_values = []

for i, row in contact_info_df.iterrows():
    data = row['contact_info']
    contact_list = json.loads(data)

    contact = []
    for key, value in contact_list.items():
        contact.append(value)
    opt_2_dict_values.append(contact)
    
print(opt_2_dict_values[0:5])

[[4661, 'Cecilia Velasco', 'cecilia.velasco@rodrigues.fr'], [3765, 'Mariana Ellis', 'mariana.ellis@rossi.org'], [4187, 'Sofie Woods', 'sofie.woods@riviere.com'], [4941, 'Jeanette Iannotti', 'jeanette.iannotti@yahoo.com'], [2199, 'Samuel Sorgatz', 'samuel.sorgatz@gmail.com']]

In [23]:
# Create a DF with contact_info --- each row should display 
#'contact_id', 'name', 'email' columns.

contacts_df = pd.DataFrame(dict_values, columns = 
                           ['contact_id', 'name', 'email'])

contacts_df.head()

   contact_id               name                         email
0        4661    Cecilia Velasco  cecilia.velasco@rodrigues.fr
1        3765      Mariana Ellis       mariana.ellis@rossi.org
2        4187        Sofie Woods       sofie.woods@riviere.com
3        4941  Jeanette Iannotti   jeanette.iannotti@yahoo.com
4        2199     Samuel Sorgatz      samuel.sorgatz@gmail.com

In [24]:
# Check the datatypes.
contacts_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   contact_id  1000 non-null   int64
 1   name        1000 non-null   object
 2   email       1000 non-null   object
dtypes: int64(1), object(2)
memory usage: 23.6+ KB

In [25]:
# Create a "first"name" and "last_name" column from the "name" column. 
contacts_df[['first name', 'last name']] = contacts_df['name'].str.split(' ', n=1, expand = True)
contacts_df.head()

# Drop the contact_name column
contacts_df= contacts_df.drop(['name'], axis = 1)
contacts_df.head()

   contact_id                         email first name last name
0        4661  cecilia.velasco@rodrigues.fr    Cecilia   Velasco
1        3765       mariana.ellis@rossi.org    Mariana     Ellis
2        4187       sofie.woods@riviere.com      Sofie     Woods
3        4941   jeanette.iannotti@yahoo.com   Jeanette  Iannotti
4        2199      samuel.sorgatz@gmail.com     Samuel   Sorgatz

In [26]:
# Reorder the columns
ordered_columns = ['contact_id', 'first name', 'last name', 'email']

In [27]:
# save DF as new dataframe
contacts_df_clean = contacts_df.reindex(columns = ordered_columns)

contacts_df_clean.head()

   contact_id first name last name                         email
0        4661    Cecilia   Velasco  cecilia.velasco@rodrigues.fr
1        3765    Mariana     Ellis       mariana.ellis@rossi.org
2        4187      Sofie     Woods       sofie.woods@riviere.com
3        4941   Jeanette  Iannotti   jeanette.iannotti@yahoo.com
4        2199     Samuel   Sorgatz      samuel.sorgatz@gmail.com

In [28]:
# Check the datatypes one more time before exporting as CSV file.
contacts_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   contact_id  1000 non-null   int64
 1   first name  1000 non-null   object
 2   last name   1000 non-null   object
 3   email       1000 non-null   object
dtypes: int64(1), object(3)
memory usage: 31.4+ KB

In [29]:
# Export the DataFrame as a CSV file. 
contacts_df_clean.to_csv("Resources/contacts.csv", encoding='utf8', index=False)

### Option 2: Use regex to create the contacts DataFrame.

In [30]:
contact_info_regex_df = contact_info_df.copy()
contact_info_regex_df.head()

                                                                                contact_info
0   {"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}
1          {"contact_id": 3765, "name": "Mariana Ellis", "email": "mariana.ellis@rossi.org"}
2            {"contact_id": 4187, "name": "Sofie Woods", "email": "sofie.woods@riviere.com"}
3  {"contact_id": 4941, "name": "Jeanette Iannotti", "email": "jeanette.iannotti@yahoo.com"}
4        {"contact_id": 2199, "name": "Samuel Sorgatz", "email": "samuel.sorgatz@gmail.com"}

In [31]:
# Extract the four-digit contact ID number.
n = '(\d{4})'

contact_info_regex_df['contact_id'] = contact_info_regex_df['contact_info'].str.extract(n, expand=True)

contact_info_regex_df.head()

                                                                                contact_info contact_id
0   {"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}       4661
1          {"contact_id": 3765, "name": "Mariana Ellis", "email": "mariana.ellis@rossi.org"}       3765
2            {"contact_id": 4187, "name": "Sofie Woods", "email": "sofie.woods@riviere.com"}       4187
3  {"contact_id": 4941, "name": "Jeanette Iannotti", "email": "jeanette.iannotti@yahoo.com"}       4941
4        {"contact_id": 2199, "name": "Samuel Sorgatz", "email": "samuel.sorgatz@gmail.com"}       2199

In [32]:
# Check the datatypes.
contact_info_regex_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   contact_info  1000 non-null   object
 1   contact_id    1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [33]:
# Convert the "contact_id" column to an int64 data type.
contact_info_regex_df['contact_id'] = contact_info_regex_df['contact_id'].astype('int64')

contact_info_regex_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   contact_info  1000 non-null   object
 1   contact_id    1000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [34]:
# Extract the name of the contact and add it to a new column.
np = '([A-Za-z]+\s+[A-ZA-z]+)'

contact_info_regex_df['name'] = contact_info_regex_df['contact_info'].str.extract(np, expand=True)

contact_info_regex_df.head()

                                                                                contact_info  contact_id               name
0   {"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}        4661    Cecilia Velasco
1          {"contact_id": 3765, "name": "Mariana Ellis", "email": "mariana.ellis@rossi.org"}        3765      Mariana Ellis
2            {"contact_id": 4187, "name": "Sofie Woods", "email": "sofie.woods@riviere.com"}        4187        Sofie Woods
3  {"contact_id": 4941, "name": "Jeanette Iannotti", "email": "jeanette.iannotti@yahoo.com"}        4941  Jeanette Iannotti
4        {"contact_id": 2199, "name": "Samuel Sorgatz", "email": "samuel.sorgatz@gmail.com"}        2199     Samuel Sorgatz

In [35]:
# # Extract the email from the contacts and add the values to a new column.
# email = '((?<="email":).*)'
test = '([A-Za-z]+\.[A-Za-z]+@.*)'

contact_info_regex_df['email'] = contact_info_regex_df['contact_info'].str.extract(test, expand=True)

contact_info_regex_df.head()

                                                                                contact_info  contact_id               name                           email
0   {"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}        4661    Cecilia Velasco  cecilia.velasco@rodrigues.fr"}
1          {"contact_id": 3765, "name": "Mariana Ellis", "email": "mariana.ellis@rossi.org"}        3765      Mariana Ellis       mariana.ellis@rossi.org"}
2            {"contact_id": 4187, "name": "Sofie Woods", "email": "sofie.woods@riviere.com"}        4187        Sofie Woods       sofie.woods@riviere.com"}
3  {"contact_id": 4941, "name": "Jeanette Iannotti", "email": "jeanette.iannotti@yahoo.com"}        4941  Jeanette Iannotti   jeanette.iannotti@yahoo.com"}
4        {"contact_id": 2199, "name": "Samuel Sorgatz", "email": "samuel.sorgatz@gmail.com"}        2199     Samuel Sorgatz      samuel.sorgatz@gmail.com"}

In [36]:
contact_info_regex_df['email'].replace('"', "",inplace=True, regex=True)
contact_info_regex_df['email'].replace('}', "",inplace=True, regex=True)

contact_info_regex_df.head()

                                                                                contact_info  contact_id               name                         email
0   {"contact_id": 4661, "name": "Cecilia Velasco", "email": "cecilia.velasco@rodrigues.fr"}        4661    Cecilia Velasco  cecilia.velasco@rodrigues.fr
1          {"contact_id": 3765, "name": "Mariana Ellis", "email": "mariana.ellis@rossi.org"}        3765      Mariana Ellis       mariana.ellis@rossi.org
2            {"contact_id": 4187, "name": "Sofie Woods", "email": "sofie.woods@riviere.com"}        4187        Sofie Woods       sofie.woods@riviere.com
3  {"contact_id": 4941, "name": "Jeanette Iannotti", "email": "jeanette.iannotti@yahoo.com"}        4941  Jeanette Iannotti   jeanette.iannotti@yahoo.com
4        {"contact_id": 2199, "name": "Samuel Sorgatz", "email": "samuel.sorgatz@gmail.com"}        2199     Samuel Sorgatz      samuel.sorgatz@gmail.com

In [37]:
# Create a copy of the contact_info_df with the 'contact_id', 'name', 'email' columns.
regex_contact_df = contact_info_regex_df[['contact_id', 'name', 'email']]

regex_contact_df.head()

   contact_id               name                         email
0        4661    Cecilia Velasco  cecilia.velasco@rodrigues.fr
1        3765      Mariana Ellis       mariana.ellis@rossi.org
2        4187        Sofie Woods       sofie.woods@riviere.com
3        4941  Jeanette Iannotti   jeanette.iannotti@yahoo.com
4        2199     Samuel Sorgatz      samuel.sorgatz@gmail.com

In [38]:
# Create a "first"name" and "last_name" column with the first and last names from the "name" column. 
regex_contact_df[['first name', 'last name']] = regex_contact_df['name'].str.split(' ', n=1, expand = True)
regex_contact_df.head()

# Drop the contact_name column
regex_contact_df = regex_contact_df.drop(['name'], axis = 1)
regex_contact_df.head()

   contact_id                         email first name last name
0        4661  cecilia.velasco@rodrigues.fr    Cecilia   Velasco
1        3765       mariana.ellis@rossi.org    Mariana     Ellis
2        4187       sofie.woods@riviere.com      Sofie     Woods
3        4941   jeanette.iannotti@yahoo.com   Jeanette  Iannotti
4        2199      samuel.sorgatz@gmail.com     Samuel   Sorgatz

In [39]:
# Reorder the columns
ordered_columns = ['contact_id', 'first name', 'last name', 'email']

In [40]:
# save DF as new dataframe
regex_contacts_df_clean = regex_contact_df.reindex(columns = ordered_columns)

regex_contacts_df_clean.head()

   contact_id first name last name                         email
0        4661    Cecilia   Velasco  cecilia.velasco@rodrigues.fr
1        3765    Mariana     Ellis       mariana.ellis@rossi.org
2        4187      Sofie     Woods       sofie.woods@riviere.com
3        4941   Jeanette  Iannotti   jeanette.iannotti@yahoo.com
4        2199     Samuel   Sorgatz      samuel.sorgatz@gmail.com

In [41]:
# Check the datatypes one more time before exporting as CSV file.
regex_contacts_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   contact_id  1000 non-null   int64
 1   first name  1000 non-null   object
 2   last name   1000 non-null   object
 3   email       1000 non-null   object
dtypes: int64(1), object(3)
memory usage: 31.4+ KB

In [42]:
# Export the DataFrame as a CSV file. 
regex_contacts_df_clean.to_csv("Resources/contacts_regex.csv", encoding='utf8', index=False)